|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [2]:
import pandas as pd
import numpy as np

In [78]:
#df = pd.read_csv(r"https://github.com/leangaurav/dsc_weekday_2020_08_13/raw/master/CODE/titanic_dataset.csv")
df=pd.read_csv("titanic_dataset.csv",index_col=0)
print(df.head())
df.describe()

   pclass  survived                                             name  gender  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000      0      0   24160  $211.34        B5        S    2    NaN
1   0.9167      1      2  113781  $151.55   C22 C26        S   11    NaN
2   2.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN
3  30.0000      1      2  113781  $151.55   C22 C26        S  NaN  135.0
4  25.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [31]:
#Find columns with missingdata
df.isnull().any()
df.isna().any()

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [57]:
#Print shape of dataset
df.shape

(1309, 14)

In [33]:
#drop columns with more than 25% missing data
df.shape
drpcol=df.columns[df.isnull().mean() > 0.25]
df.drop(list(drpcol),axis=1,inplace=True)
df.shape

Index(['cabin', 'boat', 'body', 'home.dest'], dtype='object')

(1309, 11)

In [4]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['name','fare','embarked']).head(5)

,pclass,survived,gender,age,sibsp,parch,ticket,cabin,boat,body,home.dest
0,1,1,female,29.0000,0,0,24160,B5,2,NaN,"St Louis, MO"
1,1,1,male,0.9167,1,2,113781,C22 C26,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,113781,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,113781,C22 C26,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,113781,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
#check data types of all columns
df.dtypes

pclass         int64
survived       int64
name          object
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [7]:
#convert price to numeric

df.fare=df.fare.str.replace("$",'').replace(" ",'')
print(df.fare.astype(np.float64).head())

0    211.34
1    151.55
2    151.55
3    151.55
4    151.55
Name: fare, dtype: float64

In [26]:
#find columns still having missing/na values and also count of missing data
print(df.isna())
df.isna().sum()

      pclass  survived   name  gender    age  sibsp  parch  ticket   fare  \
0      False     False  False   False  False  False  False   False  False
1      False     False  False   False  False  False  False   False  False
2      False     False  False   False  False  False  False   False  False
3      False     False  False   False  False  False  False   False  False
4      False     False  False   False  False  False  False   False  False
...      ...       ...    ...     ...    ...    ...    ...     ...    ...
1304   False     False  False   False  False  False  False   False  False
1305   False     False  False   False   True  False  False   False  False
1306   False     False  False   False  False  False  False   False  False
1307   False     False  False   False  False  False  False   False  False
1308   False     False  False   False  False  False  False   False  False

      cabin  embarked   boat   body  home.dest
0     False     False  False   True      False
1     False     False  False   True      False
2     False     False   True   True      False
3     False     False   True  False      False
4     False     False   True   True      False
...     ...       ...    ...    ...        ...
1304   True     False   True  False       True
1305   True     False   True   True       True
1306   True     False   True  False       True
1307   True     False   True   True       True
1308   True     False   True   True       True

[1309 rows x 14 columns]

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [50]:
#fill na with mean for fare and age column column.

df.fare=df.fare.str.replace("$","")
df.fare=df.fare.astype(np.float64)
#print(type(df.fare[:][0]))
df.fare.fillna(df.fare.mean(),inplace=True)
df.age.fillna(df.age.mean(),inplace=True)
df.isna().sum()

pclass          0
survived        0
name            0
gender          0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [88]:
#drop na values for embarked column.
print(df.shape)
print(df.embarked.isna().sum())
#print(df.index.where(df.embarked.isna()==True))
df.embarked.dropna(axis=0,inplace=True)
print(df.shape)

(1309, 14)
0
(1309, 14)

In [93]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
#dir(df)
df.to_csv("Titanic_filtered.csv",index=False,header=True)

In [98]:
#for surviced column replace 0 with D and 1 with A
df.survived.replace({0:"D",1:"A"},inplace=True)
print(df.head(5))

   pclass survived                                             name  gender  \
0       1        A                    Allen, Miss. Elisabeth Walton  female
1       1        A                   Allison, Master. Hudson Trevor    male
2       1        D                     Allison, Miss. Helen Loraine  female
3       1        D             Allison, Mr. Hudson Joshua Creighton    male
4       1        D  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000      0      0   24160  $211.34        B5        S    2    NaN
1   0.9167      1      2  113781  $151.55   C22 C26        S   11    NaN
2   2.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN
3  30.0000      1      2  113781  $151.55   C22 C26        S  NaN  135.0
4  25.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [99]:
#find the frequency of different values in survived column

df.survived.value_counts()

D    809
A    500
Name: survived, dtype: int64

In [125]:
#group by gender and survived and see the counts in each category

df1= df.groupby(['gender','survived'])
#print(df.groupby(['gender','survived'])['gender'].value_counts())
print(df.groupby(['gender','survived'])['gender'].count())

#print(df.groupby(['gender','survived'])['survived'].value_counts())
print(df.groupby(['gender','survived'])['survived'].count())

gender  survived  gender
female  A         female    339
        D         female    127
male    A         male      161
        D         male      682
Name: gender, dtype: int64
gender  survived
female  A           339
        D           127
male    A           161
        D           682
Name: gender, dtype: int64

In [127]:
#find different pclass and no of people in each class

print(df.groupby(['pclass'])['pclass'].count())

pclass
1    323
2    277
3    709
Name: pclass, dtype: int64

In [198]:
#find top 5 people with highest values of age. Count no of male and females in the top 5

print(df.sort_values(by=['age'],ascending=False).nlargest(5,['age']))
print(df.sort_values(by=['age'],ascending=False).nlargest(5,['age']).groupby(['gender']).age.count())

      pclass survived                                               name  \
14         1        A               Barkworth, Mr. Algernon Henry Wilson
61         1        A  Cavendish, Mrs. Tyrell William (Julia Florence...
1235       3        D                                Svensson, Mr. Johan
135        1        D                          Goldschmidt, Mr. George B
9          1        D                            Artagaveytia, Mr. Ramon

      gender   age  sibsp  parch    ticket     fare cabin embarked boat  body  \
14      male  80.0      0      0     27042  $30.00    A23        S    B   NaN
61    female  76.0      1      0     19877  $78.85    C46        S    6   NaN
1235    male  74.0      0      0    347060   $7.78    NaN        S  NaN   NaN
135     male  71.0      0      0  PC 17754  $34.65     A5        C  NaN   NaN
9       male  71.0      0      0  PC 17609  $49.50    NaN        C  NaN  22.0

                    home.dest
14              Hessle, Yorks
61    Little Onn Hall, Staffs
1235                      NaN
135              New York, NY
9         Montevideo, Uruguay
gender
female    1
male      4
Name: age, dtype: int64

In [263]:

#find max age male and female who survived

filter1=df.survived=='A' 
filter2= ~(df.survived.isna())
df.where(filter2 | filter1 ).groupby(['gender']).age.max()

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [264]:
#get average age by gender
df.groupby(['gender']).age.mean()

gender
female    28.687071
male      30.585233
Name: age, dtype: float64

In [265]:

#get average age by people survived vs not-survived
filter1= ~(df.survived.isna())

df.where(filter1).groupby(['survived']).age.mean()

survived
A    28.918228
D    30.545369
Name: age, dtype: float64